docs/site/20260102230046-bellamy_lanz_practicing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>bellamy-lanz practicing</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">bellamy-lanz practicing</h1>
<p>
Notes from lecture given at IDRS 2025 Butler
</p>

<p>
How to Practice: Frameworks from Atheltic Training
</p>

<p>
Music Performance is an athletic pursuit
</p>
<ul class="org-ul">
<li>Physical Demands
<ul class="org-ul">
<li>Endurance</li>
<li>Strength</li>
<li>Speed</li>
<li>Coordination</li>
<li>Risks of injuries</li>
</ul></li>
<li>Long Term Planning
<ul class="org-ul">
<li>Goals</li>
<li>Concerts</li>
<li>Auditions</li>
<li>Degrees</li>
</ul></li>
<li>Event Specific Skills
<ul class="org-ul">
<li>Double Tonguing</li>
<li>Tapers to niente</li>
<li>Double tongue at 140 on D from Figaro</li>
<li>Rite of Spring in tune from nothing</li>
</ul></li>
</ul>

<p>
Session Types
</p>
<ul class="org-ul">
<li>Speed/Power &#x2013; about 50%</li>
<li>Cross Train: complimentary skills, muscles, or systems &#x2013; about 10%</li>
<li>Active Recovery: stretch, shake out &#x2013; about 10%</li>
<li>Endurance: exhaustion or simulate performance &#x2013; about 25%</li>
<li>Rest &#x2013; about 5%</li>
</ul>

<p>
Endurance: 3-4 per week, not running pieces half the time
</p>
<ul class="org-ul">
<li>Long tones</li>
<li>Reed making</li>
<li>Slow etudes</li>
<li>run through / reps</li>
<li>Double tonguing</li>
<li>Standing</li>
<li>Anything to exhaustion</li>
</ul>

<p>
Speed/Power: 5-6 per week
</p>
<ul class="org-ul">
<li>Scales (fast)</li>
<li>"sprints" small unit getting faster and faster</li>
<li>modifier - jumping jacks or trampoline before techincal passages, metronome work</li>
<li>long tones</li>
<li>tonguing drills</li>
<li>vibrato exercises</li>
<li>targeted scales/etudes</li>
</ul>

<p>
Cross train: 1-2 per week
</p>
<ul class="org-ul">
<li>Sight reading</li>
<li>Improv</li>
<li>Score study</li>
<li>Reference listening</li>
<li>Contextual research</li>
</ul>

<p>
Active Recovery: 1-2 per week
</p>
<ul class="org-ul">
<li>fun run</li>
<li>jam session</li>
<li>arrangement/transcription/composition</li>
<li>discovery listening</li>
</ul>

<p>
Prehab/Rehab: daily
</p>
<ul class="org-ul">
<li>reed making</li>
<li>stretching</li>
<li>breath work</li>
</ul>

<p>
Race Specific: as needed near event
</p>
<ul class="org-ul">
<li>Dress rehearsal</li>
<li>Run throughs</li>
<li>Mock audition</li>
</ul>

<p>
Periodized Training: Athletics
</p>

<p>
Race                           |  Macrocycle                                           | 
Development Goals |Mesocycle| |Base| |Build| |Specialize|  
Heart Rate                  
Power Zones            |&#x2013;| |&#x2013;| |&#x2013;| |&#x2013;| &#x2026;. 
                                   microcycles
Workouts                   ||||| ||||| ||||| |||||  &#x2026;
                                   Individual workouts
</p>

<p>
Session Goal
</p>

<p>
Focus blocks         Mesocycle  | Fundamentals | Develop | Perform |
Skill Types            |&#x2014;| |&#x2014;| |&#x2014;|
Practice Sessions ||||| ||||| |||||
</p>

<p>
Macrocycles:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">All State Audition</th>
<th scope="col" class="org-left">College Audition</th>
<th scope="col" class="org-left">Spring Recital</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">May-November</td>
<td class="org-left">September-February</td>
<td class="org-left">January-April</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Lyrical Etude</td>
<td class="org-left">Lyrical Solo</td>
<td class="org-left">Solo Repertoire</td>
</tr>

<tr>
<td class="org-left">Tech Etude</td>
<td class="org-left">Tech Solo</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Major Scale</td>
<td class="org-left">Etude Selection</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Minor Scale</td>
<td class="org-left">Excerpts</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Chromatic Scale</td>
<td class="org-left">Maj Scales</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Min Scales</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Sight Reading</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Mesocycles:
Base Training - Tone, Intonation, all registers
Build Period - Range, Fluency
Specializations - Extended Techniques, Extreme Registers
Performance - Mock Performance, Performance Psychology
</p>

<p>
Microcycle for Recital
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">August</th>
<th scope="col" class="org-left">Sept</th>
<th scope="col" class="org-left">Nov</th>
<th scope="col" class="org-left">Jan</th>
<th scope="col" class="org-left">March</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Base</td>
<td class="org-left">Extreme Range LT</td>
<td class="org-left">Extracted Tech</td>
<td class="org-left">Special Skills LT</td>
<td class="org-left">Applicable Warm up Routine</td>
</tr>

<tr>
<td class="org-left">LT</td>
<td class="org-left">Related Scales</td>
<td class="org-left">Metronome</td>
<td class="org-left">Reference Listening</td>
<td class="org-left">Masterclasses</td>
</tr>

<tr>
<td class="org-left">Scales</td>
<td class="org-left">Related Etudes</td>
<td class="org-left">Score Study</td>
<td class="org-left">Collab Rehearsals</td>
<td class="org-left">Recorded Runs</td>
</tr>

<tr>
<td class="org-left">Etudes</td>
<td class="org-left">D.T. (etc)</td>
<td class="org-left">Design Unit Exerc</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Dress Rehearsals</td>
</tr>

<tr>
<td class="org-left">Sight Read</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Speed Power Session:
15 min fundamentals, 5 minute sightreading, 5 break, 25 etudes
</p>

<p>
<b><b>Need slides from Cayla Bellamy</b></b>
</p>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
